# Просмотр таблицы MAC-адресов коммутатора
---
#### Топология

![pics](https://github.com/2lama2/otus_engineer_basic/blob/8dfa04bcb4959f55fd180dd0ea3b347fa50d229d/pics/Pasted%20image%2020220424145135.png)

![[Pasted image 20220424145135.png]]

#### Таблица адресации

**Устройство**|**Интерфейс**|**IP-адрес**|**Маска подсети**
:---:|:---:|:---:|:---:
S1|VLAN1|192.168.1.11|255.255.255.0
S2|VLAN1|192.168.1.12|255.255.255.0
VPC1|VLAN1|192.168.1.1|255.255.255.0
VPC2|VLAN1|192.168.1.2|255.255.255.0

#### Цели
Часть 1. Создание и настройк сети
Часть 2. Изучение таблицы MAC-адресов коммутатора

#### Изучение таблицы MAC-адресов коммутатора

##### 1. MAC-адреса сетевых учтройств
* На VPC1 и VPC2 выполним команду **`show ip all`**:

	```
	VPC1> sho ip all
	
	NAME   IP/MASK              GATEWAY           MAC                DNS
	VPC1   192.168.1.1/24       255.255.255.0     00:50:79:66:68:01
	```

	```
	VPC2> sh ip all
	
	NAME   IP/MASK              GATEWAY           MAC                DNS
	VPC2   192.168.1.2/24       255.255.255.0     00:50:79:66:68:04
	```

* На коммутаторах S1 и S2 для интерфейсов **`e0/0`** выполним команду **`show interface e0/0`**:

	```
	S1#sh interfaces e0/0
	Ethernet0/0 is up, line protocol is up (connected)
	  Hardware is Ethernet, address is aabb.cc00.2000 (bia aabb.cc00.2000)
	```

	```
	S2#sh interfaces e0/0
	Ethernet0/0 is up, line protocol is up (connected)
	  Hardware is Ethernet, address is aabb.cc00.3000 (bia aabb.cc00.3000)
	```

##### 2. Таблица MAC-адресов коммутатора

* Посмотрим таблицу MAC-адресов на коммутаторе S2:

	```
	S2#sh mac address-table
	          Mac Address Table
	-------------------------------------------
	
	Vlan    Mac Address       Type        Ports
	----    -----------       --------    -----
	   1    aabb.cc00.2000    DYNAMIC     Et0/0
	Total Mac Addresses for this criterion: 1
	```

	Коммутатор S2 знает о существовании устройства с MAC-адресом `aabb.cc00.2000`, находящимся за портом `Et0/0`. В данном случае этим устройством является интерфейс `Et0/0` коммутатор S1.

**Вопрос:** как можно определить, каким устройствам принадлежат МАС-адреса, используя только выходные данные команды show mac address-table?
> Зная только MAC-адрес устройства, можно узнать производителя сетевого оборудования по первым 3-м байтам MAC-адреса. Сделав предположение о наличии данного сетевого оборудования на каком-то из устройств, можно идентифицировать данное устройство.
> 
> Вышеуказанный способ определения сетевого устройства по MAC-адресу производителя не всегда будет применим, т.к. на большинстве сетевых устройств есть возможность смены MAC-адреса на произвольный.

##### 3. Очистка таблицы MAC-адресов коммутатора

* На коммутаторе S2 очистим таблицу MAC-адресов, заполненных динамически и выведем ее на экран:

	```
	S2#clear  mac address-table dynamic
	S2#sh mac address-table
          Mac Address Table
	-------------------------------------------
	
	Vlan    Mac Address       Type        Ports
	----    -----------       --------    -----
	   1    aabb.cc00.2000    DYNAMIC     Et0/0
	Total Mac Addresses for this criterion: 1
	```

	Таблица содержит информацию об одном адресе  - соседнем коммутаторе S1.

##### 4. Изучение таблицы MAC-адресов коммутатора и ПК по результатам работы команды PING

* Посмотрим ARP-таблицу на VPC2:

	```
	VPC2> sh arp
	arp table is empty
	```

* На VPC2 выполним команду PING до VPC1 и до обоих коммутаторов:

	```
	VPC2> ping 192.168.1.1
	
	84 bytes from 192.168.1.1 icmp_seq=1 ttl=64 time=0.335 ms
	84 bytes from 192.168.1.1 icmp_seq=2 ttl=64 time=0.758 ms
	84 bytes from 192.168.1.1 icmp_seq=3 ttl=64 time=0.647 ms
	84 bytes from 192.168.1.1 icmp_seq=4 ttl=64 time=0.570 ms
	84 bytes from 192.168.1.1 icmp_seq=5 ttl=64 time=0.594 ms
	
	VPC2> ping 192.168.1.11
	
	84 bytes from 192.168.1.11 icmp_seq=1 ttl=255 time=0.329 ms
	84 bytes from 192.168.1.11 icmp_seq=2 ttl=255 time=0.530 ms
	84 bytes from 192.168.1.11 icmp_seq=3 ttl=255 time=0.562 ms
	84 bytes from 192.168.1.11 icmp_seq=4 ttl=255 time=0.660 ms
	84 bytes from 192.168.1.11 icmp_seq=5 ttl=255 time=0.531 ms
	
	VPC2> ping 192.168.1.12
	
	84 bytes from 192.168.1.12 icmp_seq=1 ttl=255 time=0.247 ms
	84 bytes from 192.168.1.12 icmp_seq=2 ttl=255 time=0.356 ms
	84 bytes from 192.168.1.12 icmp_seq=3 ttl=255 time=0.242 ms
	84 bytes from 192.168.1.12 icmp_seq=4 ttl=255 time=0.345 ms
	84 bytes from 192.168.1.12 icmp_seq=5 ttl=255 time=0.174 ms
	```

* Еще раз изучим таблицы MAC-адресов на VPC2 и S2:

	```
	VPC2> sh arp
	
	00:50:79:66:68:01  192.168.1.1 expires in 94 seconds
	aa:bb:cc:80:20:00  192.168.1.11 expires in 106 seconds
	aa:bb:cc:80:30:00  192.168.1.12 expires in 113 seconds
	```

	```
	S2#sh mac address-table
	          Mac Address Table
	-------------------------------------------
	
	Vlan    Mac Address       Type        Ports
	----    -----------       --------    -----
	   1    0050.7966.6801    DYNAMIC     Et0/0
	   1    0050.7966.6804    DYNAMIC     Et0/1
	   1    aabb.cc00.2000    DYNAMIC     Et0/0
	   1    aabb.cc80.2000    DYNAMIC     Et0/0
	Total Mac Addresses for this criterion: 4
	```

	Таблицы MAC-адресов заполнились изученными адресами устройств, взаимодействовавшими в процессе выполнения команды PING.

##### Вопрос для повторения

В сетях Ethernet данные передаются на устройства по соответствующим МАС-адресам. Для этого коммутаторы и компьютеры динамически создают ARP-кэш и таблицы МАС-адресов. Если компьютеров в сети немного, эта процедура выглядит достаточно простой. Какие сложности могут возникнуть в крупных сетях?

> В крупных сетях с большим количеством сетевых устройств может произойти переполнение Таблиц MAC-адресов на комутаторах.

