## Доступ к сетевым устройствам по протоколу SSH

#### Топология

![[Pasted image 20220503190058.png]]
#### Таблица адресации

| **Устройство** | **Интерфейс** | **IP-адрес** | **Маска подсети** | **Шлюз по умолчанию** |
|:---------------|:--------------|:-------------|:------------------|:----------------------|
| **R1**             | e0/0          | 192.168.1.1  | 255.255.255.0     | -                     |
| **S1**             | VLAN 1        | 192.168.1.11 | 255.255.255.0     | 192.168.1.1           |
| **Linux**          | NIC           | 192.168.1.3  | 255.255.255.0     | 192.168.1.1           |

#### Задачи

1. Настройка основных параметров устройств
2. Настройка маршрутизатора для доступа по протоколу SSH
3. Настройка коммутатора для доступа по протоколу SSH
4. SSH через интерфейс командной строки (CLI) коммутатора

---

### 1. Настройка основных параметров устройств
* Настроим маршрутизатор **`R1`** небезопасным образом, задав пароль с шифрованием на привилегированный режим, а также пароли без шифрования для доступа к консоли и линиям vty :

	```
	R1(config)# enable secret P@ssw0rd
	
	R1(config)# line console 0
	R1(config-line)# password P@ssw0rd
	R1(config-line)# login
	
	R1(config-line)# line vty 0 4
	R1(config-line)# password P@ssw0rd
	R1(config-line)# login
	R1(config-line)# transport input telnet
	```

	В конфигурации будут присутствовать пароли, хранящиеся в открытом виде:

	```
	R1(config-line)# do sh run | sec line
	line con 0
	 password P@ssw0rd
	 logging synchronous
	 login
	line aux 0
	line vty 0 4
	 password P@ssw0rd
	 login
	 transport input telnet
	```

	Сделаем конфигурацию немного безопаснее, зашифровав пароли с помощью команды:

	```
	R1(config)# service password-encryption
	```

	Проверим результат:

	```
	R1(config)# do sh run | sec line
	line con 0
	 password 7 053B261C325B1E1B1D
	 logging synchronous
	 login
	line aux 0
	line vty 0 4
	 password 7 01232617481C561D25
	 login
	 transport input telnet
	```

	Сделаем окончательную настройку маршрутизатора **`R1`**:

	```
	R1(config)# banner motd #
	Enter TEXT message.  End with the character '#'.
	Yeah!?#
	R1(config)# int e0/0
	R1(config-if)# ip addr 192.168.1.1 255.255.255.0
	R1(config-if)# no shutdown
	R1(config-if)# do wr
	Building configuration...
	[OK]
	```

* Настроим компьютер **`Linux`** и проверим с него доступность маршрутизатора **`R1`**:

	```
	root@Linux:~# cat /etc/network/interfaces
	......
	# The primary network interface
	allow-hotplug ens3
	iface ens3 inet static
		address 192.168.1.3/24
		gateway 192.168.1.1
	
	root@Linux:~# ping 192.168.1.1
	PING 192.168.1.1 (192.168.1.1) 56(84) bytes of data.
	64 bytes from 192.168.1.1: icmp_seq=1 ttl=255 time=0.536 ms
	64 bytes from 192.168.1.1: icmp_seq=2 ttl=255 time=0.817 ms
	64 bytes from 192.168.1.1: icmp_seq=3 ttl=255 time=0.565 ms
	^C
	--- 192.168.1.1 ping statistics ---
	3 packets transmitted, 3 received, 0% packet loss, time 5ms
	rtt min/avg/max/mdev = 0.536/0.639/0.817/0.127 ms
	```

### 2. Настройка маршрутизатора для доступа по протоколу SSH
* Для настройки доступа по протоколу SSH выполним следующие шаги:

	Зададим имя и домен для устройства:
	
	```
	R1(config)# hostname R1
	
	R1(config)# ip domain-name lab.local
	```

	Создадим имя пользователя и пароль в локальной базе учетных данных:

	```
	R1(config)# username admin privilege 15 secret P@ssw0rd
	```

	Выполним генерацию ключей шифрования:

	```
	R1(config)# crypto key generate rsa general-keys modulus 2048
	
	The name for the keys will be: R1.lab.local
	
	% The key modulus size is 2048 bits
	% Generating 2048 bit RSA keys, keys will be non-exportable...
	[OK] (elapsed time was 1 seconds)
	```

	Будем использовать 2-ю версию протокола SSH, как более безопасную:

	```
	R1(config)# ip ssh version 2
	```

	Настроим линии VTY - выберем все доступные линии, разрешим протокол SSH и разрешим использовать локальную базу пользователей:

	```
	R1(config)# line vty 0 4
	R1(config-line)# transport input ssh
	R1(config-line)# login local
	```

* Проверим доступность маршрутизатора **`R1`** с компьютера **`Linux`** по протоколу SSH:

	```
	root@Linux:~# ssh admin@192.168.1.1
	The authenticity of host '192.168.1.1 (192.168.1.1)' can't be established.
	RSA key fingerprint is SHA256:VYeM3z6hKSCX+zTbllLj3KaEObnNl4AeAdbpVGOEFyM.
	Are you sure you want to continue connecting (yes/no)? yes
	Warning: Permanently added '192.168.1.1' (RSA) to the list of known hosts.
	Password: 
	
	Yeah!?
	R1#
	```

### 3. Настройка коммутатора для доступа по протоколу SSH
* Проведем настройку коммутатора **`S1`** подобно маршрутизатору **`R1`**:

	```
	S1(config)# enable secret P@ssw0rd
	
	S1(config)# line console 0
	S1(config-line)# password P@ssw0rd
	S1(config-line)# login
	
	S1(config-line)# line vty 0 4
	S1(config-line)# password P@ssw0rd
	S1(config-line)# login
	S1(config-line)# transport input telnet
	
	S1(config)# banner motd #
	Enter TEXT message.  End with the character '#'.
	Nope!#
	S1(config)# int vlan 1
	S1(config-if)# ip addr 192.168.1.11 255.255.255.0
	S1(config-if)# no shutdown
	S1(config-if)# do wr
	```

* Настроим коммутатор **`S1`** для работы с протоколом SSH:

	```
	S1(config)# hostname S1
	
	S1(config)# ip domain-name lab.local
	
	S1(config)# username admin privilege 15 secret P@ssw0rd
	
	S1(config)# crypto key generate rsa general-keys modulus 2048
	
	S1(config)# ip ssh version 2
	
	S1(config)# line vty 0 4
	S1(config-line)# transport input ssh
	S1(config-line)# login local
	```

* Проверим доступность коммутатора **`S1`** с компьютера **`Linux`** по протоколу SSH:

	```
	root@Linux:~# ssh admin@192.168.1.11

	The authenticity of host '192.168.1.11 (192.168.1.11)' can't be established.
	RSA key fingerprint is SHA256:ripvQKQPBfTaiHgo0Nph2ff9pKcqE8N5xfmejGkeGNE.
	Are you sure you want to continue connecting (yes/no)? yes
	Warning: Permanently added '192.168.1.11' (RSA) to the list of known hosts.
	Password: 
	
	Nope!
	S1#
	```

### 4. SSH через интерфейс командной строки (CLI) коммутатора
* Из интерфейса CLI операционной системы Cisco IOS можно подключться к сетевому устройству по протоколу SSH с помощью следующей команды:

	```
	S1# ssh -l admin 192.168.1.1
	Password:
	
	Yeah!?
	R1#
	```

	При активной сессии по протоколу SSH, для временного переключения к интерфейсу локального устройства, используется последовательное нажатие комбинации клавиш **`CTRL+SHIFT+6`**, затем **`x`**.

	Выход из сессии SSH-подключения осуществляется командой **`exit`**.

### Вопрос для повторения
* Как предоставить доступ к сетевому устройству нескольким пользователям, у каждого из которых есть собственное имя пользователя?
	> Для предоставления указанного доступа необходимо создать учетную запись для каждого пользователя в локальной базе пользователей на самом устройстве и разрешить использовать для аутентификации локальную базу, либо необходимо настроить новую модель аутентификации (**aaa new-model**) и завести требуемых пользователей в удаленной аутентифицирующей системе.
