## Конфигурация безопасности коммутатора

#### Топология
![[Pasted image 20220531000413.png]]

![Pics](https://github.com/2lama2/otus_engineer_basic/blob/4f23a77345eb3a64d49503e4c19293657fa6242f/pics/Pasted%20image%2020220531000413.png)
#### Таблица адресации

<table>
<thead>
  <tr>
    <th>Устройство</th>
    <th>interface/vlan</th>
    <th>IP-адрес</th>
    <th>Маска подсети</th>
  </tr>
</thead>
<tbody>
  <tr>
    <td rowspan="2">R1</td>
    <td>e0/0</td>
    <td>192.168.10.1</td>
    <td>255.255.255.0</td>
  </tr>
  <tr>
    <td>Loopback 0</td>
    <td>10.10.1.1</td>
    <td>255.255.255.0</td>
  </tr>
  <tr>
    <td>S1</td>
    <td>VLAN 10</td>
    <td>192.168.10.201</td>
    <td>255.255.255.0</td>
  </tr>
  <tr>
    <td>S2</td>
    <td>VLAN 10</td>
    <td>192.168.10.202</td>
    <td>255.255.255.0</td>
  </tr>
  <tr>
    <td>PC1</td>
    <td>NIC</td>
    <td>DHCP</td>
    <td>255.255.255.0</td>
  </tr>
  <tr>
    <td>PC2</td>
    <td>NIC</td>
    <td>DHCP</td>
    <td>255.255.255.0</td>
  </tr>
</tbody>
</table>

#### Задачи
1. Настройка основного сетевого устройства
	- Создание сети
	- Настройка маршрутизатора R1
	- Настройка и проверка основных параметров коммутатора
2. Настройка сетей VLAN
	- Конфигурирование VLAN 10
	- Конфигурирование SVI для VLAN 10
	- Настройка VLAN 333 с именем NATIVE на S1 и S2
	- Настройка VLAN 999 с именем PL на S1 и S2
3. Настройки безопасности коммутатора
	- Реализация магистральных соединений 802.1Q
	- Настройка портов доступа
	- Безопасность неиспользуемых портов коммутатора
	- Документирование и реализация функций безопасности порта
	- Реализация безопасности DHCP snooping
	- Реализация PortFast и BPDU Guard
	- Проверка сквозной связности

---

### 1. Настройка основного сетевого устройства
* Создадим сетевую топологию в среде виртуализации EVE-NG.
* Выполним следующий конфигурационный скрипт на маршрутизаторе R1:

	```
	enable
	configure terminal
	hostname R1
	no ip domain lookup
	ip dhcp excluded-address 192.168.10.1 192.168.10.9
	ip dhcp excluded-address 192.168.10.201 192.168.10.202
	!
	ip dhcp pool Students
	 network 192.168.10.0 255.255.255.0
	 default-router 192.168.10.1
	 domain-name CCNA2.Lab-11.6.1
	!
	interface Loopback0
	 ip address 10.10.1.1 255.255.255.0
	!
	interface Ethernet0/0
	 description Link to S1
	 ip dhcp relay information trusted
	 ip address 192.168.10.1 255.255.255.0
	 no shutdown
	!
	line con 0
	 logging synchronous
	 exec-timeout 0 0
	```

* Проверим состояние интерфейсов. Убедимся, что они включены и настроены корректно:

	```
	R1# sh ip int brief
	Interface                  IP-Address      OK? Method Status                Protocol
	Ethernet0/0                192.168.10.1    YES manual up                    up  
	Ethernet0/1                unassigned      YES unset  administratively down down
	Ethernet0/2                unassigned      YES unset  administratively down down
	Ethernet0/3                unassigned      YES unset  administratively down down
	Loopback0                  10.10.1.1       YES manual up                    up  
	```

* Выполним начальную настройку коммутаторов S1 и S2.
	* Переименуем устройства в соответствии со схемой:
		`sw(config)# hostname 'HOSTNAME'`
	* Запретим нежелательный поиск в DNS:
		`sw(config)# no ip domain-lookup`
	* Установим шлюз по умолчанию:
		`sw(config)# ip default-gateway 192.168.10.1`

### 2. Настройка сетей VLAN
* На обоих коммутаторах добавим VLAN 10 с именем Management:

	```
	sw(config)# vlan 10
	sw(config-vlan)# name Management
	```

* Также на обоих коммутаторах добавим виртуальный интерфейс SVI для VLAN 10 и назначим ему соответствующий IP-адрес из таблицы адресации:

	```
	sw(config)# interface vlan 10
	sw(config-if)# ip address IP-ADDRESS NETMASK
	sw(config-if)# no sh
	sw(config-if)# description MGMT
	```

* Завершим настройку VLAN для коммутаторов S1 и S2 добавлением VLAN 333 и VLAN 999:

	```
	sw(config)# vlan 333
	sw(config-vlan)# name Native
	sw(config)# vlan 999
	sw(config-vlan)# name PL
	```

### 3. Настройки безопасности коммутатора
* Выполним настройку магистральных соединений 802.1Q на коммутаторах S1 и S2:

	```
	sw(config)# int e0/2
	sw(config-if)# switchport trunk encapsulation dot1q
	sw(config-if)# switchport mode trunk
	sw(config-if)# switchport trunk native vlan 333
	
	sw(config-if)# do sh int trunk
	
	Port        Mode             Encapsulation  Status        Native vlan
	Et0/2       on               802.1q         trunking      333
	
	Port        Vlans allowed on trunk
	Et0/2       1-4094
	
	Port        Vlans allowed and active in management domain
	Et0/2       1,10,333,999
	
	Port        Vlans in spanning tree forwarding state and not pruned
	Et0/2       1,10,333,999
	```

* В качестве меры безопасности отключим на транковых портах протокол автосогласования режима работы порта DTP:

	```
	sw(config-if)# switchport nonegotiate
	
	sw# sh int e0/2 switchport | i Negotiation
	
	Negotiation of Trunking: Off
	```

* На коммутаторе S1 настроим режимы доступа на соответствующих портах:

	```
	S1(config)# int range e0/0-1
	S1(config-if-range)# switchport mode access
	S1(config-if-range)# switchport access vlan 10
	```

* На коммутаторе S2 настроим режим доступа для порта, куда подключено клиентское устройство:

	```
	S2(config)# int e0/0
	S2(config-if)# switchport mode access
	S2(config-if)# switchport access vlan 10
	```

* В качестве меры безопасности отключим все неиспользуемые порты и добавим их во VLAN 999, которая создана как раз для изолирования неиспользуемых портов:

	```
	S1(config-if)# do sh int status
	
	Port      Name               Status       Vlan       Duplex  Speed Type
	Et0/0     Link to R1         connected    10         a-full   auto RJ45
	Et0/1     Link to PC1        connected    10         a-full   auto RJ45
	Et0/2     Link to S2         connected    trunk      a-full   auto RJ45
	Et0/3                        disabled     999          auto   auto RJ45
	
	S2(config-if)#do sh int status
	
	Port      Name               Status       Vlan       Duplex  Speed Type
	Et0/0     Link to PC2        connected    10         a-full   auto RJ45
	Et0/1                        disabled     999          auto   auto RJ45
	Et0/2     Link to S1         connected    trunk      a-full   auto RJ45
	Et0/3                        disabled     999          auto   auto RJ45
	```


### 4. Документирование и реализация функций безопасности порта
* Изучим параметры связанные с механизмом **Port-Security**, установленные в конфигурации по умолчанию:

	```
	S1# sh port-security interface e0/1
	```
	
	Полученные значения занесем в таблицу

<table>
<thead>
  <tr>
    <th colspan="2">Конфигурация безопасности порта по умолчанию</th>
  </tr>
</thead>
<tbody>
  <tr>
    <td>Функция</td>
    <td>Настройка по умолчанию</td>
  </tr>
  <tr>
    <td>Защита портов</td>
    <td>Disabled</td>
  </tr>
  <tr>
    <td>Максимальное количество записей MAC-адресов</td>
    <td>1</td>
  </tr>
  <tr>
    <td>Режим проверки на нарушение безопасности</td>
    <td>Shutdown</td>
  </tr>
  <tr>
    <td>Aging Time</td>
    <td>0min</td>
  </tr>
  <tr>
    <td>Aging Type</td>
    <td>Absolute</td>
  </tr>
  <tr>
    <td>Secure Static Address Aging</td>
    <td>Disabled</td>
  </tr>
  <tr>
    <td>Sticky MAC Address</td>
    <td>0</td>
  </tr>
</tbody>
</table>

* Включим режим Port-Security со следующими параметрами:

	**Максимальное количество записей MAC-адресов**: 3
	**Режим безопасности**: restrict
	**Aging time**: 60 мин
	**Aging type**: неактивный

	```
	S1(config)# int e0/1
	S1(config-if)# switchport port-security aging time 60
	S1(config-if)# switchport port-security aging type inactivity
	S1(config-if)# switchport port-security violation restrict
	S1(config-if)# switchport port-security maximum 3
	S1(config-if)# switchport port-security
	```

	```
	S1#sh port-security int e0/1
	Port Security              : Enabled
	Port Status                : Secure-up
	Violation Mode             : Restrict
	Aging Time                 : 60 mins
	Aging Type                 : Inactivity
	SecureStatic Address Aging : Disabled
	Maximum MAC Addresses      : 3
	Total MAC Addresses        : 1
	Configured MAC Addresses   : 0
	Sticky MAC Addresses       : 0
	Last Source Address:Vlan   : 0050.0000.0400:10
	Security Violation Count   : 0
	```

	```
	S1# sh port-security address
               Secure Mac Address Table
	-----------------------------------------------------------------------------
	Vlan    Mac Address       Type                          Ports   Remaining Age
	                                                                   (mins)
	----    -----------       ----                          -----   -------------
	  10    0050.0000.0400    SecureDynamic                 Et0/1       60 (I)
	-----------------------------------------------------------------------------
	Total Addresses in System (excluding one mac per port)     : 0
	Max Addresses limit in System (excluding one mac per port) : 4096
	```

* Включим режим Port-Security на коммутаторе S2 для порта e0/0 со следующими параметрами:

	**Максимальное количество записей MAC-адресов**: 2
	**Режим безопасности**: protect
	**Aging time**: 60 мин

	А также включим динамическое изучение MAC-адреса на данном порту и сохранение его в текущую конфигурацию командой `switchport port-security mac-address sticky`:

	```
	S2(config)# int e0/0
	S2(config-if)# switchport port-security aging time 60
	S2(config-if)# switchport port-security violation protect
	S2(config-if)# switchport port-security maximum 2
	S2(config-if)# switchport port-security mac-address sticky
	S2(config-if)# switchport port-security
	```

	```
	S1#sh port-security int e0/0
	Port Security              : Enabled
	Port Status                : Secure-up
	Violation Mode             : Protect
	Aging Time                 : 60 mins
	Aging Type                 : Absolute
	SecureStatic Address Aging : Disabled
	Maximum MAC Addresses      : 2
	Total MAC Addresses        : 1
	Configured MAC Addresses   : 0
	Sticky MAC Addresses       : 1
	Last Source Address:Vlan   : 0050.0000.0500:10
	Security Violation Count   : 0
	```

	```
	S1# sh port-security address
               Secure Mac Address Table
	-----------------------------------------------------------------------------
	Vlan    Mac Address       Type                          Ports   Remaining Age
	                                                                   (mins)
	----    -----------       ----                          -----   -------------
	  10    0050.0000.0500    SecureSticky                 Et0/0         -
	-----------------------------------------------------------------------------
	Total Addresses in System (excluding one mac per port)     : 0
	Max Addresses limit in System (excluding one mac per port) : 4096
	```

* Выполним настройку механизма защиты **DHCP snooping**, который используется для предотвращения следующих видов атак:
	* Истощение DHCP пула
	* Rogue DHCP-server
	* ARP-poisoning

	Включим DHCP snooping на коммутаторе S2 и задействуем этот механизм защиты во VLAN 10:

	```
	S2(config)# ip dhcp snooping
	S2(config)# ip dhcp snooping vlan 10
	```

	Настроим магистральный порт e0/2 на S2 как доверенный:

	```
	S2(config)# int e0/2
	S2(config-if)# ip dhcp snooping trust
	```

	Также на коммутаторе S2 ограничим ненадежный клиентский порт e0/0 пятью DHCP-пакетами в секунду:

	```
	S2(config-if)# int e0/0
	S2(config-if)# ip dhcp snooping limit rate 5
	```

	Убедимся, что все настройки сделаны верно следующей командой:

	```
	S2(config-if)# do sh ip dhcp snooping
	
	Switch DHCP snooping is enabled
	Switch DHCP gleaning is disabled
	DHCP snooping is configured on following VLANs:
	10
	DHCP snooping is operational on following VLANs:
	10
	DHCP snooping is configured on the following L3 Interfaces:
	
	Insertion of option 82 is enabled
	   circuit-id default format: vlan-mod-port
	   remote-id: aabb.cc00.2000 (MAC)
	Option 82 on untrusted port is not allowed
	Verification of hwaddr field is enabled
	Verification of giaddr field is enabled
	DHCP snooping trust/rate is configured on the following Interfaces:
	
		Interface                  Trusted    Allow option    Rate limit (pps)
	-----------------------    -------    ------------    ----------------
	Ethernet0/0                no         no              5
	  Custom circuit-ids:
	Ethernet0/2                yes        yes             unlimited
	  Custom circuit-ids:
	```

	Проверим привязку отслеживания DHCP с помощью команды:

	```
	S2# sh ip dhcp snooping binding
	MacAddress          IpAddress        Lease(sec)  Type           VLAN  Interface
	------------------  ---------------  ----------  -------------  ----  --------------------
	00:50:00:00:05:00   192.168.10.12    86388       dhcp-snooping   10    Ethernet0/0
	Total number of bindings: 1
	```

* В целях защиты протокота STP от намеренного или ненамеренного вмешательства настроим механизмы защиты **PortFast** и **BPDU Guard**.

	Для коммутаторов S1 и S2 включим механизм защиты PortFast глобально для всех портов, затем отключим данный механизм на магистральных портах, т.к. PortFast необходимо включать только на портах доступа:

	```
	sw(config)# spanning-tree portfast default
	sw(config)# int range [TRUNK-PORT-RANGE]
	sw(config-if-range)# spanning-tree portfast disable
	```

	На обоих коммутаторах включим механизм BPDU Guard на портах доступа VLAN 10, подключенных к PC1 и PC2:

	```
	S1(config)# int e0/1
	S1(config-if)# spanning-tree bpduguard enable
	
	S1#sh span int e0/1 detail
	
	 Port 2 (Ethernet0/1) of VLAN0010 is designated forwarding
	   Port path cost 100, Port priority 128, Port Identifier 128.2.
	   Designated root has priority 32778, address aabb.cc00.1000
	   Designated bridge has priority 32778, address aabb.cc00.1000
	   Designated port id is 128.2, designated path cost 0
	   Timers: message age 0, forward delay 0, hold 0
	   Number of transitions to forwarding state: 1
	   The port is in the portfast edge mode by default
	   Link type is point-to-point by default
	   Bpdu guard is enabled
	   BPDU: sent 2767, received 0
	```

	```
	S2(config)# int e0/0
	S2(config-if)# spanning-tree bpduguard enable
	
	S2# sh span int e0/0 detail
	
	 Port 1 (Ethernet0/0) of VLAN0010 is designated forwarding
	   Port path cost 100, Port priority 128, Port Identifier 128.1.
	   Designated root has priority 32778, address aabb.cc00.1000
	   Designated bridge has priority 32778, address aabb.cc00.2000
	   Designated port id is 128.1, designated path cost 100
	   Timers: message age 0, forward delay 0, hold 0
	   Number of transitions to forwarding state: 1
	   The port is in the portfast edge mode by default
	   Link type is point-to-point by default
	   Bpdu guard is enabled
	   BPDU: sent 2794, received 0
	```

* Проверим связность устройств командой PING:

	```
	root@PC1:~# ping 192.168.10.1 -c 2
	
	PING 192.168.10.1 (192.168.10.1) 56(84) bytes of data.
	64 bytes from 192.168.10.1: icmp_seq=1 ttl=255 time=0.633 ms
	64 bytes from 192.168.10.1: icmp_seq=2 ttl=255 time=0.669 ms
	
	--- 192.168.10.1 ping statistics ---
	2 packets transmitted, 2 received, 0% packet loss, time 16ms
	rtt min/avg/max/mdev = 0.633/0.651/0.669/0.018 ms
	
	root@PC1:~# ping 192.168.10.11 -c 2
	
	PING 192.168.10.11 (192.168.10.11) 56(84) bytes of data.
	64 bytes from 192.168.10.11: icmp_seq=1 ttl=64 time=1.41 ms
	64 bytes from 192.168.10.11: icmp_seq=2 ttl=64 time=0.915 ms
	
	--- 192.168.10.11 ping statistics ---
	2 packets transmitted, 2 received, 0% packet loss, time 3ms
	rtt min/avg/max/mdev = 0.915/1.162/1.410/0.249 ms
	
	root@PC1:~# ping 192.168.10.201 -c 2
	
	PING 192.168.10.201 (192.168.10.201) 56(84) bytes of data.
	64 bytes from 192.168.10.201: icmp_seq=1 ttl=255 time=0.873 ms
	64 bytes from 192.168.10.201: icmp_seq=2 ttl=255 time=0.516 ms
	
	--- 192.168.10.201 ping statistics ---
	2 packets transmitted, 2 received, 0% packet loss, time 2ms
	rtt min/avg/max/mdev = 0.516/0.694/0.873/0.180 ms
	
	root@PC1:~# ping 192.168.10.202 -c 2
	
	PING 192.168.10.202 (192.168.10.202) 56(84) bytes of data.
	64 bytes from 192.168.10.202: icmp_seq=1 ttl=255 time=0.905 ms
	64 bytes from 192.168.10.202: icmp_seq=2 ttl=255 time=0.786 ms
	
	--- 192.168.10.202 ping statistics ---
	2 packets transmitted, 2 received, 0% packet loss, time 3ms
	rtt min/avg/max/mdev = 0.786/0.845/0.905/0.066 ms
	```

	```
	root@PC2:~# ping -c 2 192.168.10.1
	
	PING 192.168.10.1 (192.168.10.1) 56(84) bytes of data.
	64 bytes from 192.168.10.1: icmp_seq=1 ttl=255 time=0.836 ms
	64 bytes from 192.168.10.1: icmp_seq=2 ttl=255 time=0.993 ms
	
	--- 192.168.10.1 ping statistics ---
	2 packets transmitted, 2 received, 0% packet loss, time 22ms
	rtt min/avg/max/mdev = 0.836/0.914/0.993/0.084 ms
	
	root@PC2:~# ping -c 2 192.168.10.201
	
	PING 192.168.10.201 (192.168.10.201) 56(84) bytes of data.
	64 bytes from 192.168.10.201: icmp_seq=1 ttl=255 time=1.20 ms
	64 bytes from 192.168.10.201: icmp_seq=2 ttl=255 time=0.820 ms
	
	--- 192.168.10.201 ping statistics ---
	2 packets transmitted, 2 received, 0% packet loss, time 4ms
	rtt min/avg/max/mdev = 0.820/1.008/1.197/0.191 ms
	
	root@PC2:~# ping -c 2 192.168.10.10
	
	PING 192.168.10.10 (192.168.10.10) 56(84) bytes of data.
	64 bytes from 192.168.10.10: icmp_seq=1 ttl=64 time=0.880 ms
	64 bytes from 192.168.10.10: icmp_seq=2 ttl=64 time=0.842 ms
	
	--- 192.168.10.10 ping statistics ---
	2 packets transmitted, 2 received, 0% packet loss, time 33ms
	rtt min/avg/max/mdev = 0.842/0.861/0.880/0.019 ms
	```

### Вопросы для повторения
* С точки зрения безопасности порта на S2, почему нет значения таймера для оставшегося возраста в минутах, когда было сконфигурировано динамическое обучение - sticky?
	> Для статически заданных MAC-адресов, по умолчанию нет времени устаревания. Режим sticky фактически является статическим закреплением динамически выученного MAC-адреса. Таким образом тоже не использует время устаревания адреса.

* Что касается безопасности порта на S2, если вы загружаете скрипт текущей конфигурации на S2, почему порту 18 на PC2 никогда не получит IP-адрес через DHCP?
	> Не понятен вопрос.
* Что касается безопасности порта, в чем разница между типом абсолютного устаревания и типом устаревание по неактивности?
	> В режиме абсолютного времени устаревания, выученный адрес на порту будет сброшен принудительно по прошествии заданного времени.
	> В случае же учета активности на порту, таймер устаревания будет установливаться на начальное значение при наличии активности на порту и сброс адреса будет возможен только тогда, когда не будет никакой активности на порту за промежуток времени, равный установленному значению.
