## Настройка и проверка расширенных списков контроля доступа

#### Топология
![[Pasted image 20220605215329.png]]
#### Таблица адресации

<table>
<thead>
  <tr>
    <th>Устройство</th>
    <th>Интерфейс</th>
    <th>IP-адрес</th>
    <th>Маска подсети</th>
    <th>Шлюз по умолчанию</th>
  </tr>
</thead>
<tbody>
  <tr>
    <td rowspan="6">R1</td>
    <td>e0/0</td>
    <td>-</td>
    <td>-</td>
    <td rowspan="6">-</td>
  </tr>
  <tr>
    <td>e0/0.20</td>
    <td>10.20.0.1</td>
    <td>255.255.255.0</td>
  </tr>
  <tr>
    <td>e0/0.30</td>
    <td>10.30.0.1</td>
    <td>255.255.255.0</td>
  </tr>
  <tr>
    <td>e0/0.40</td>
    <td>10.40.0.1</td>
    <td>255.255.255.0</td>
  </tr>
  <tr>
    <td>e0/0.1000</td>
    <td>-</td>
    <td>-</td>
  </tr>
  <tr>
    <td>Loopback1</td>
    <td>172.16.1.1</td>
    <td>255.255.255.0</td>
  </tr>
  <tr>
    <td>R2</td>
    <td>e0/0</td>
    <td>10.20.0.4</td>
    <td>255.255.255.0</td>
    <td>-</td>
  </tr>
  <tr>
    <td>S2</td>
    <td>VLAN 20</td>
    <td>10.20.0.2</td>
    <td>255.255.255.0</td>
    <td>10.20.0.1</td>
  </tr>
  <tr>
    <td>S3</td>
    <td>VLAN 20</td>
    <td>10.20.0.3</td>
    <td>255.255.255.0</td>
    <td>10.20.0.1</td>
  </tr>
  <tr>
    <td>Linux1</td>
    <td>NIC</td>
    <td>10.30.0.10</td>
    <td>255.255.255.0</td>
    <td>10.30.0.1</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>NIC</td>
    <td>10.40.0.10</td>
    <td>255.255.255.0</td>
    <td>10.40.0.1</td>
  </tr>
</tbody>
</table>

#### Таблица VLAN
<table>
<thead>
  <tr>
    <th>VLAN</th>
    <th>Имя</th>
    <th>Назначенный интерфейс</th>
  </tr>
</thead>
<tbody>
  <tr>
    <td>20</td>
    <td>MGMT</td>
    <td>S3: e0/0</td>
  </tr>
  <tr>
    <td>30</td>
    <td>OPERATIONS</td>
    <td>S2: e0/2</td>
  </tr>
  <tr>
    <td>40</td>
    <td>SALES</td>
    <td>S3: e0/2</td>
  </tr>
  <tr>
    <td>999</td>
    <td>PL</td>
    <td>S2: e0/3<br>S3: e0/3</td>
  </tr>
  <tr>
    <td>1000</td>
    <td>NATIVE</td>
    <td>-</td>
  </tr>
</tbody>
</table>

На маршрутизаторе R1 будет настроено интернет-соединение (смоделированное интерфейсом Loopback 1). Также R1 будет предоставлять информацию о маршруте по умолчанию для R2.

#### Задачи

1. Создание сети и настройка основных параметров устройства
2. Настройка и проверка списков расширенного контроля доступа

---

### 1. Создание сети и настройка основных параметров устройства
* Создадим топологию сети в EVE-NG.

* Выполним базовую настройку маршрутизаторов и коммутаторов по шаблону:

	```
	HOSTNAME# clock set HH:MM:SS DAY MONTH YEAR
	HOSTNAME# configure terminal
	HOSTNAME(config)# hostname ==HOSTNAME==
	
	HOSTNAME(config)# enable secret ==PASSWORD==
	HOSTNAME(config)# service password-encryption
	
	HOSTNAME(config)# banner motd #Warning! Ye've been warned!#
	
	HOSTNAME(config)# no ip domain-lookup
	
	HOSTNAME(config)# line console 0
	HOSTNAME(config-line)# password ==PASSWORD==
	HOSTNAME(config-line)# login
	
	HOSTNAME(config-line)# logging synchronous
	
	HOSTNAME(config)# line vty 0 4
	HOSTNAME(config-line)# password ==PASSWORD==
	HOSTNAME(config-line)# login
	HOSTNAME(config-line)# transport input telnet
	
	HOSTNAME# copy running-config startup-config
	```

* Выполним настройку VLAN и SVI на коммутаторах согласно таблице VLAN и таблице адресации:

	```
	S2# sh ip int brief
	
	Interface              IP-Address      OK? Method Status                Protocol
	Ethernet0/0            unassigned      YES unset  up                    up
	Ethernet0/1            unassigned      YES unset  up                    up
	Ethernet0/2            unassigned      YES unset  up                    up
	Ethernet0/3            unassigned      YES unset  administratively down down
	Vlan20                 10.20.0.2       YES manual down                  down
	
	S2# sh ip redirects
	
	Default gateway is 10.20.0.1
	......
	
	S2# sh vlan brief
	
	VLAN Name                             Status    Ports
	---- -------------------------------- --------- -------------------------------
	1    default                          active    Et0/0, Et0/1
	20   MGMT                             active
	30   OPERATIONS                       active    Et0/2
	40   SALES                            active
	999  PL                               active    Et0/3
	1000 NATIVE                           active
	......
	```

	```
	S3# sh ip int brief
	
	Interface              IP-Address      OK? Method Status                Protocol
	Ethernet0/0            unassigned      YES unset  up                    up
	Ethernet0/1            unassigned      YES unset  up                    up
	Ethernet0/2            unassigned      YES unset  up                    up
	Ethernet0/3            unassigned      YES unset  administratively down down
	Vlan20                 10.20.0.3       YES manual up                    up
	
	S3# sh ip redirects
	
	Default gateway is 10.20.0.1
	......
	
	S3# sh vlan brief
	
	VLAN Name                             Status    Ports
	---- -------------------------------- --------- -------------------------------
	1    default                          active    Et0/1
	20   MGMT                             active    Et0/0
	30   OPERATIONS                       active
	40   SALES                            active    Et0/2
	999  PL                               active    Et0/3
	1000 NATIVE                           active
	......
	```

* Настроим на коммутаторах магистральные каналы:

	```
	S2# sh int trunk
	
	Port        Mode             Encapsulation  Status        Native vlan
	Et0/0       on               802.1q         trunking      1000
	Et0/1       on               802.1q         trunking      1000
	
	Port        Vlans allowed on trunk
	Et0/0       20,30,40,1000
	Et0/1       20,30,40,1000
	
	Port        Vlans allowed and active in management domain
	Et0/0       20,30,40,1000
	Et0/1       20,30,40,1000
	
	Port        Vlans in spanning tree forwarding state and not pruned
	Et0/0       20,30,40,1000
	Et0/1       20,30,40,1000
	```

	```
	S3# sh int trunk
	
	Port        Mode             Encapsulation  Status        Native vlan
	Et0/1       on               802.1q         trunking      1000
	
	Port        Vlans allowed on trunk
	Et0/1       20,30,40,1000
	
	Port        Vlans allowed and active in management domain
	Et0/1       20,30,40,1000
	
	Port        Vlans in spanning tree forwarding state and not pruned
	Et0/1       20,30,40,1000
	```

* Настроим маршрутизацию на R1:

	```
	R1# sh run | sec interface
	
	interface Loopback1
	 ip address 172.16.1.1 255.255.255.0
	
	interface Ethernet0/0
	 no ip address
	 duplex auto
	
	interface Ethernet0/0.20
	 description MGMT
	 encapsulation dot1Q 20
	 ip address 10.20.0.1 255.255.255.0
	
	interface Ethernet0/0.30
	 description OPERATIONS
	 encapsulation dot1Q 30
	 ip address 10.30.0.1 255.255.255.0
	
	interface Ethernet0/0.40
	 description SALES
	 encapsulation dot1Q 40
	 ip address 10.40.0.1 255.255.255.0
	
	interface Ethernet0/0.1000
	 description NATIVE
	 encapsulation dot1Q 1000
	......
	```

* На маршрутизаторе R2 настроим интерфейс **`e0/0`** из таблицы адресации, а также маршрут по умолчанию со ссылкой на R1:

	```
	R2#sh run | sec interface
	
	interface Ethernet0/0
	 ip address 10.20.0.4 255.255.255.0
	 duplex auto
	......
	
	R2# sh ip route static | b Gate
	Gateway of last resort is 10.20.0.1 to network 0.0.0.0
	
	S*    0.0.0.0/0 [1/0] via 10.20.0.1
	
	```

* Выполним настройку доступа по прооколу SSH на всех сетевых устройствах.

	```
	HOST(config)# hostname HOST
	
	HOST(config)# ip domain-name ccna-lab.com
	
	HOST(config)# username admin privilege 15 secret P@ssw0rd
	
	HOST(config)# crypto key generate rsa general-keys modulus 2048
	
	HOST(config)# ip ssh version 2
	
	HOST(config)# line vty 0 4
	HOST(config-line)# transport input ssh
	HOST(config-line)# login local
	```

* Включим защищенные веб-службы с проверкой подлинности на R1.

	```
	R1(config)# ip http secure-server
	
	% Generating 1024 bit RSA keys, keys will be non-exportable...
	[OK] (elapsed time was 0 seconds)
	Failed to generate persistent self-signed certificate.
	    Secure server will use temporary self-signed certificate.
	
	R1(config)# ip http authentication local
	```

* Настроим клиентские машины по таблице адресации и выполним тесты для проверки правильности функционирования схемы.

<table>
<thead>
  <tr>
    <th>От</th>
    <th>Протокол</th>
    <th>Назначение</th>
  </tr>
</thead>
<tbody>
  <tr>
    <td>Linux1</td>
    <td>Ping</td>
    <td>10.40.0.10</td>
  </tr>
  <tr>
    <td>Linux1</td>
    <td>Ping</td>
    <td>10.20.0.1</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>Ping</td>
    <td>10.30.0.10</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>Ping</td>
    <td>10.20.0.1</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>Ping</td>
    <td>172.16.1.1</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>HTTPS</td>
    <td>10.20.0.1</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>HTTPS</td>
    <td>172.16.1.1</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>SSH</td>
    <td>10.20.0.1</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>SSH</td>
    <td>172.16.1.1</td>
  </tr>
</tbody>
</table>

<details><summary> Все проверки пройдены. Настройка макета проведена успешно.</summary>
<p>

```
root@Linux1:~# ping -c 3 10.40.0.10

PING 10.40.0.10 (10.40.0.10) 56(84) bytes of data.
64 bytes from 10.40.0.10: icmp_seq=1 ttl=63 time=1.63 ms
64 bytes from 10.40.0.10: icmp_seq=2 ttl=63 time=2.02 ms
64 bytes from 10.40.0.10: icmp_seq=3 ttl=63 time=1.67 ms

--- 10.40.0.10 ping statistics ---
3 packets transmitted, 3 received, 0% packet loss, time 6ms
rtt min/avg/max/mdev = 1.631/1.772/2.017/0.177 ms

root@Linux1:~# ping -c 3 10.20.0.1

PING 10.20.0.1 (10.20.0.1) 56(84) bytes of data.
64 bytes from 10.20.0.1: icmp_seq=1 ttl=255 time=0.541 ms
64 bytes from 10.20.0.1: icmp_seq=2 ttl=255 time=0.615 ms
64 bytes from 10.20.0.1: icmp_seq=3 ttl=255 time=0.644 ms

--- 10.20.0.1 ping statistics ---
3 packets transmitted, 3 received, 0% packet loss, time 42ms
rtt min/avg/max/mdev = 0.541/0.600/0.644/0.043 ms

root@Linux2:~# ping -c 3 10.30.0.10

PING 10.30.0.10 (10.30.0.10) 56(84) bytes of data.
64 bytes from 10.30.0.10: icmp_seq=1 ttl=63 time=1.47 ms
64 bytes from 10.30.0.10: icmp_seq=2 ttl=63 time=1.51 ms
64 bytes from 10.30.0.10: icmp_seq=3 ttl=63 time=1.54 ms

--- 10.30.0.10 ping statistics ---
3 packets transmitted, 3 received, 0% packet loss, time 6ms
rtt min/avg/max/mdev = 1.466/1.504/1.536/0.028 ms

root@Linux2:~# ping -c 3 10.20.0.1

PING 10.20.0.1 (10.20.0.1) 56(84) bytes of data.
64 bytes from 10.20.0.1: icmp_seq=1 ttl=255 time=1.23 ms
64 bytes from 10.20.0.1: icmp_seq=2 ttl=255 time=0.876 ms
64 bytes from 10.20.0.1: icmp_seq=3 ttl=255 time=0.917 ms

--- 10.20.0.1 ping statistics ---
3 packets transmitted, 3 received, 0% packet loss, time 6ms
rtt min/avg/max/mdev = 0.876/1.007/1.229/0.159 ms

root@Linux2:~# ping -c 3 172.16.1.1

PING 172.16.1.1 (172.16.1.1) 56(84) bytes of data.
64 bytes from 172.16.1.1: icmp_seq=1 ttl=255 time=0.738 ms
64 bytes from 172.16.1.1: icmp_seq=2 ttl=255 time=1.31 ms
64 bytes from 172.16.1.1: icmp_seq=3 ttl=255 time=1.03 ms

--- 172.16.1.1 ping statistics ---
3 packets transmitted, 3 received, 0% packet loss, time 14ms
rtt min/avg/max/mdev = 0.738/1.026/1.313/0.234 ms

root@Linux2:~# ssh 10.20.0.1

The authenticity of host '10.20.0.1 (10.20.0.1)' can't be established.
RSA key fingerprint is SHA256:daDihS37zDdwOwrr5fGkCIz1sAeGTY5zvvmanzpXziE.
Are you sure you want to continue connecting (yes/no)? yes
Warning: Permanently added '10.20.0.1' (RSA) to the list of known hosts.
Password: 

root@Linux2:~# ssh 172.16.1.1

The authenticity of host '172.16.1.1 (172.16.1.1)' can't be established.
RSA key fingerprint is SHA256:daDihS37zDdwOwrr5fGkCIz1sAeGTY5zvvmanzpXziE.
Are you sure you want to continue connecting (yes/no)? yes
Warning: Permanently added '172.16.1.1' (RSA) to the list of known hosts.
Password: 

root@Linux2:~# openssl s_client 10.20.0.1:443

CONNECTED(00000003)
......
Server certificate
-----BEGIN CERTIFICATE-----
.....

root@Linux2:~# openssl s_client 172.16.1.1:443

CONNECTED(00000003)
......
Server certificate
-----BEGIN CERTIFICATE-----
......
```

</p>
</details>

### 2. Настройка и проверка списков расширенного контроля доступа

Разработаем, применим и протестируем следующие политики безопасности:

**Политика**1. Сеть Sales не может использовать SSH в сети MGMT (но в  другие сети SSH разрешен).

**Политика 2**. Сеть Sales не имеет доступа к IP-адресам в сети MGMT с помощью любого веб-протокола (HTTP/HTTPS). Сеть Sales также не имеет доступа к интерфейсам R1 с помощью любого веб-протокола. Разрешён весь другой веб-трафик (обратите внимание — Сеть Sales  может получить доступ к интерфейсу Loopback 1 на R1).

**Политика**3. Сеть Sales не может отправлять эхо-запросы ICMP в сети Operations или MGMT. Разрешены эхо-запросы ICMP к другим адресатам.

**Политика 4**: Cеть Operations  не может отправлять ICMP эхозапросы в сеть Sales. Разрешены эхо-запросы ICMP к другим адресатам.

Выполним следующие тесты и убедимся, что политики реализованы правильно и результаты тестов соответствуют ожидаемым.

<table>
<thead>
  <tr>
    <th>От</th>
    <th>Протокол</th>
    <th>Назначение</th>
    <th>Результат</th>
  </tr>
</thead>
<tbody>
  <tr>
    <td>Linux1</td>
    <td>Ping</td>
    <td>10.40.0.10</td>
    <td>Сбой</td>
  </tr>
  <tr>
    <td>Linux1</td>
    <td>Ping</td>
    <td>10.20.0.1</td>
    <td>Успех</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>Ping</td>
    <td>10.30.0.10</td>
    <td>Сбой</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>Ping</td>
    <td>10.20.0.1</td>
    <td>Сбой</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>Ping</td>
    <td>172.16.1.1</td>
    <td>Успех</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>HTTPS</td>
    <td>10.20.0.1</td>
    <td>Сбой</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>HTTPS</td>
    <td>172.16.1.1</td>
    <td>Успех</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>SSH</td>
    <td>10.20.0.1</td>
    <td>Сбой</td>
  </tr>
  <tr>
    <td>Linux2</td>
    <td>SSH</td>
    <td>172.16.1.1</td>
    <td>Успех</td>
  </tr>
</tbody>
</table>

