## Настройка протоколов CDP, LLDP и NTP

#### Топология
![Pics](https://github.com/2lama2/otus_engineer_basic/blob/9439058b84c62a4c051f63e98a350350dbf68450/pics/Pasted%20image%2020220611174709.png)

#### Таблица адресации

<table>
<thead>
  <tr>
    <th>Устройство</th>
    <th>Интерфейс</th>
    <th>IP-адрес</th>
    <th>Маска подсети</th>
    <th>Шлюз по умолчанию</th>
  </tr>
</thead>
<tbody>
  <tr>
    <td rowspan="2">R1</td>
    <td>Loopback1</td>
    <td>172.16.1.1</td>
    <td>255.255.255.0</td>
    <td rowspan="2">-</td>
  </tr>
  <tr>
    <td>e0/0</td>
    <td>10.22.0.1</td>
    <td>255.255.255.0</td>
  </tr>
  <tr>
    <td>S1</td>
    <td>SVI VLAN 1</td>
    <td>10.22.0.2</td>
    <td>255.255.255.0</td>
    <td>10.22.0.1</td>
  </tr>
  <tr>
    <td>S2</td>
    <td>SVI VLAN 1</td>
    <td>10.22.0.3</td>
    <td>255.255.255.0</td>
    <td>10.22.0.1</td>
  </tr>
</tbody>
</table>

#### Задачи

1. Создание сети и настройка основных параметров устройства
2. Обнаружение сетевых ресурсов с помощью протокола CDP
3. Обнаружение сетевых ресурсов с помощью протокола LLDP
4. Настройка и проверка NTP

---

### 1. Создание сети и настройка основных параметров устройства
* Создадим топологию сети в EVE-NG.

* Выполним базовую настройку маршрутизаторов и коммутаторов по шаблону:

	```
	HOSTNAME# clock set HH:MM:SS DAY MONTH YEAR
	HOSTNAME# configure terminal
	HOSTNAME(config)# hostname ==HOSTNAME==
	
	HOSTNAME(config)# enable secret ==PASSWORD==
	HOSTNAME(config)# service password-encryption
	
	HOSTNAME(config)# banner motd #Warning! Ye've been warned!#
	
	HOSTNAME(config)# no ip domain-lookup
	
	HOSTNAME(config)# line console 0
	HOSTNAME(config-line)# password ==PASSWORD==
	HOSTNAME(config-line)# login
	
	HOSTNAME(config-line)# logging synchronous
	
	HOSTNAME(config)# line vty 0 4
	HOSTNAME(config-line)# password ==PASSWORD==
	HOSTNAME(config-line)# login
	HOSTNAME(config-line)# transport input telnet
	
	HOSTNAME# copy running-config startup-config
	```

* Настроим интерфейсы маршрутизатора по таблице адресации:

	```
	R1# sh run | sec interface
	
	interface Loopback1
	 ip address 172.16.1.1 255.255.255.0
	interface Ethernet0/0
	 ip address 10.22.0.1 255.255.255.0
	 duplex auto
	......
	```

* Для коммутаторов пока не будем настраивать интерфейсы SVI, только отключим неиспользуемые интерфейсы.

### 2. Обнаружение сетевых ресурсов с помощью протокола CDP
* Потренируемся работать c информацией протокола CDP.

	Посмотрим общую информацию о работе протокола на интерфейсах:

	```
	R1# sh cdp interface
	
	Ethernet0/0 is up, line protocol is up
	  Encapsulation ARPA
	  Sending CDP packets every 60 seconds
	  Holdtime is 180 seconds
	Ethernet0/1 is administratively down, line protocol is down
	  Encapsulation ARPA
	  Sending CDP packets every 60 seconds
	  Holdtime is 180 seconds
	Ethernet0/2 is administratively down, line protocol is down
	  Encapsulation ARPA
	  Sending CDP packets every 60 seconds
	  Holdtime is 180 seconds
	Ethernet0/3 is administratively down, line protocol is down
	  Encapsulation ARPA
	  Sending CDP packets every 60 seconds
	  Holdtime is 180 seconds
	
	 cdp enabled interfaces : 4
	 interfaces up          : 1
	 interfaces down        : 3
	```
	вывод команды показывает, что протокол CDP работает на всех доступных интерфейсах.

	Посмотрим на каких интерфейсах присутствует информация о соседних устройствах и что это за соседи:

	```
	R1# sh cdp neighbors
	
	Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
	                  S - Switch, H - Host, I - IGMP, r - Repeater, P - Phone,
	                  D - Remote, C - CVTA, M - Two-port Mac Relay
	
	Device ID        Local Intrfce     Holdtme    Capability  Platform  Port ID
	S1               Eth 0/0           179             R S I  Linux Uni Eth 0/0
	
	Total cdp entries displayed : 1
	```
	протокол CDP предоставил нам информацию об устройстве с именем **`S1`**. Идентификатором порта данного устройства является e0/0 и доступно это устройство через локальный интерфейс e0/0 маршрутизатора **`R1`**.
	Выведем подробную информацию об устройстве **`S1`**, предоставленную протоколом CDP:

	```
	R1# sh cdp entry S1

	-------------------------
	Device ID: S1
	Entry address(es):
	Platform: Linux Unix,  Capabilities: Router Switch IGMP
	Interface: Ethernet0/0,  Port ID (outgoing port): Ethernet0/0
	Holdtime : 158 sec
	
	Version :
	Cisco IOS Software, Linux Software (I86BI_LINUXL2-ADVENTERPRISEK9-M), Version 15.2(CML_NIGHTLY_20180510)FLO_DSGS7, EARLY DEPLOYMENT DEVELOPMENT BUILD, synced to  V152_6_0_81_E
	Technical Support: http://www.cisco.com/techsupport
	Copyright (c) 1986-2018 by Cisco Systems, Inc.
	Compiled Thu 10-May-18 02:45 by mmen
	
	advertisement version: 2
	VTP Management Domain: ''
	Native VLAN: 1
	Duplex: full
	```

	На стороне коммутатора **`S1`** выполним следующую команду,чтобы посмотреть статистику использования протокола CDP:

	```
	S1# sh cdp traffic
	
	CDP counters :
	        Total packets output: 5490, Input: 2694
	        Hdr syntax: 0, Chksum error: 0, Encaps failed: 0
	        No memory: 0, Invalid packet: 0,
	        CDP version 1 advertisements output: 0, Input: 0
	        CDP version 2 advertisements output: 5490, Input: 2694
	```

	Настроим виртуальные интерфейсы коммутаторов  по таблице адресации и на маршрутизаторе снова посмотрим информацию о соседнем устройстве, предоставленную протоколом CDP:

	```
	R1# sh cdp entry S1
	
	-------------------------
	Device ID: S1
	Entry address(es):
	  IP address: 10.22.0.2
	Platform: Linux Unix,  Capabilities: Router Switch IGMP
	Interface: Ethernet0/0,  Port ID (outgoing port): Ethernet0/0
	Holdtime : 159 sec
	
	Version :
	Cisco IOS Software, Linux Software (I86BI_LINUXL2-ADVENTERPRISEK9-M), Version 15.2(CML_NIGHTLY_20180510)FLO_DSGS7, EARLY DEPLOYMENT DEVELOPMENT BUILD, synced to  V152_6_0_81_E
	Technical Support: http://www.cisco.com/techsupport
	Copyright (c) 1986-2018 by Cisco Systems, Inc.
	Compiled Thu 10-May-18 02:45 by mmen
	
	advertisement version: 2
	VTP Management Domain: ''
	Native VLAN: 1
	Duplex: full
	Management address(es):
	  IP address: 10.22.0.2
	```
	вывод команды показывает, что по протоколу CDP теперь дополнительно сообщается об IP-адресе ранее указанного интерфейса.

	Для перехода к изучению следующего протокола отключим протокол CDP на всех устройствах глобально:

	```
	HOSTNAME(config)# no cdp run

	HOSTNAME(config)# do sh cdp
	% CDP is not enabled
	```


### 3. Обнаружение сетевых ресурсов с помощью протокола LLDP
* По аналогии с протоколом CDP изучим работу протокола LLDP.

	На коммутаторе **`S1`** выведем информацию предоставленную протоколом LLDP о соседних устройствах:

	```
	S1# sh lldp neighbors

	Capability codes:
	    (R) Router, (B) Bridge, (T) Telephone, (C) DOCSIS Cable Device
	    (W) WLAN Access Point, (P) Repeater, (S) Station, (O) Other
	
	Device ID           Local Intf     Hold-time  Capability      Port ID
	S2                  Et0/1          120        R               Et0/1
	R1                  Et0/0          120        R               Et0/0
	
	Total entries displayed: 2
	```

	Посмотрим подробную информацию об устройстве **`S2`**:

	```
	S1# sh lldp entry S2
	
	Capability codes:
	    (R) Router, (B) Bridge, (T) Telephone, (C) DOCSIS Cable Device
	    (W) WLAN Access Point, (P) Repeater, (S) Station, (O) Other
	------------------------------------------------
	Local Intf: Et0/1
	Chassis id: aabb.cc00.3000
	Port id: Et0/1
	Port Description: Ethernet0/1
	System Name: S2
	
	System Description:
	Cisco IOS Software, Linux Software (I86BI_LINUXL2-ADVENTERPRISEK9-M), Version 15.2(CML_NIGHTLY_20180510)FLO_DSGS7, EARLY DEPLOYMENT DEVELOPMENT BUILD, synced to  V152_6_0_81_E
	Technical Support: http://www.cisco.com/techsupport
	Copyright (c) 1986-2018 by
	
	Time remaining: 103 seconds
	System Capabilities: B,R
	Enabled Capabilities: R
	Management Addresses:
	    IP: 10.22.0.3
	Auto Negotiation - not supported
	Physical media capabilities - not advertised
	Media Attachment Unit type - not advertised
	Vlan ID: - not advertised
	
	Total entries displayed: 1
	```
	выводимая информация примерно соответствует выводу по протоколу CDP.

	Как и в случае с протоколом CDP, используя команду `show lldp neighbors` на всех устройствах, можно составить топологию физических подключений  для исследуемых устройств:

	```
	R1# sh lldp neighbors
	
	Capability codes:
	    (R) Router, (B) Bridge, (T) Telephone, (C) DOCSIS Cable Device
	    (W) WLAN Access Point, (P) Repeater, (S) Station, (O) Other
	
	Device ID           Local Intf     Hold-time  Capability      Port ID
	S1                  Et0/0          120        R               Et0/0
	
	Total entries displayed: 1
	```

	```
	S1# sh lldp neighbors
	
	Capability codes:
	    (R) Router, (B) Bridge, (T) Telephone, (C) DOCSIS Cable Device
	    (W) WLAN Access Point, (P) Repeater, (S) Station, (O) Other
	
	Device ID           Local Intf     Hold-time  Capability      Port ID
	S2                  Et0/1          120        R               Et0/1
	R1                  Et0/0          120        R               Et0/0
	
	Total entries displayed: 2
	```

	```
	S2# sh lldp neighbors
	
	Capability codes:
	    (R) Router, (B) Bridge, (T) Telephone, (C) DOCSIS Cable Device
	    (W) WLAN Access Point, (P) Repeater, (S) Station, (O) Other
	
	Device ID           Local Intf     Hold-time  Capability      Port ID
	S1                  Et0/1          120        R               Et0/1
	
	Total entries displayed: 1
	```

### 4. Настройка и проверка NTP
* Настроим маршрутизатор **`R1`** в качестве источника времени для коммутаторов **`S1`** и **`S2`**.

	Выведем текущее время на устройстве командой:

	```
	HOSTNAME# sh clock detail

	*16:38:46.626 MSK Sun Jun 12 2022
	Time source is hardware calendar
	```

	Задать время на устройстве можно следующей командой:

	```
	R1# clock set 21:23:00 13 jun 2022
	```

	Настроим маршрутизатор **`R1`** в качестве источника времени с уровнем слоя (stratum) равным 4:

	```
	R1(config)# ntp master 4
	```

	На коммутаторах зададим источником времени по протоколу NTP маршрутизатор **`R1`**:

	```
	S1(config)# ntp server 10.22.0.1
	```

	После настройки источника времени включим периодическое обновление календаря на устройстве и убедимся в корректности настройки:

	```
	S1(config)# ntp update-calendar
	
	S1(config)# do sh clock detail
	*21:35:40.268 MSK Sun Jun 12 2022
	Time source is NTP
	```

	Информацию о синхронизации времени и его источнике можно узнать с помощью команды:

	```
	S1# sh ntp associations
	
	  address         ref clock       st   when   poll reach  delay  offset   disp
	*~10.22.0.1       127.127.1.1      4     98     64     1  1.000 -57861. 7938.4
	 * sys.peer, # selected, + candidate, - outlyer, x falseticker, ~ configured
	```

	Более подробную информацию можно получить так:

	```
	S1# sh ntp associations detail
	
	10.22.0.1 configured, ipv4, our_master, sane, valid, stratum 4
	ref ID 127.127.1.1    , time E6516A80.2C8B4410 (10:49:20.174 MSK Mon Jun 13 2022)
	our mode client, peer mode server, our poll intvl 64, peer poll intvl 64
	root delay 0.00 msec, root disp 2.36, reach 1, sync dist 7942.46
	delay 1.00 msec, offset -57861.4979 msec, dispersion 7938.47, jitter 0.97 msec
	precision 2**10, version 4
	assoc id 55795, assoc name 10.22.0.1
	assoc in packets 778, assoc out packets 779, assoc error packets 13
	org time 00000000.00000000 (03:00:00.000 MSK Mon Jan 1 1900)
	rec time E6516A8D.AE147CC0 (10:49:33.680 MSK Mon Jun 13 2022)
	xmt time E6516A8D.AE147CC0 (10:49:33.680 MSK Mon Jun 13 2022)
	filtdelay =     1.00    0.00    0.00    0.00    0.00    0.00    0.00    0.00
	filtoffset = -57861.    0.00    0.00    0.00    0.00    0.00    0.00    0.00
	filterror =     1.95 16000.0 16000.0 16000.0 16000.0 16000.0 16000.0 16000.0
	minpoll = 6, maxpoll = 10
	```

> **PS:**
> Выше представлен алгоритм работы с протоколом NTP для клиентов и серверных конфигураций. В связи с особенностями виртуального стенда, некоторые моменты с настройкой и синхронизацией времени не были реализованы. Например, видна большая разница между аппаратными часами "сервера" времени (в данном случае это маршрутизатор **`R1`**) и программными часами операционной системы (в данном случае linux-реализация Cisco IOS).
>```
>R1# sh calendar
>
>22:23:54 MSK Sun Jan 27 1918
>
>R1# sh clock detail
>
>11:19:17.982 MSK Mon Jun 13 2022
>Time source is NTP
>
>R1# sh ntp associations
>
>	address         ref clock       st   when   poll reach  delay  offset   disp
>	*~127.127.1.1     .LOCL.           3      3     16   377  0.000   0.000  1.204
>	 * sys.peer, # selected, + candidate, - outlyer, x falseticker, ~ configured
>```

### Вопросы для повторения
* Для каких интерфейсов в пределах сети не следует использовать протоколы обнаружения сетевых ресурсов?
	> На тех интерфейсах, за которыми не предполагается использование управляемого нами сетевого оборудования, не нужно включать протоколы обнаружения сетевых ресурсов (например, сеть провайдера или инетрфейсы, к которым подключается клиентское оборудование).
